{"work":[{"company":"Double Bits Ltd.","position":"Owner","startDate":"2013-09","priority":2,"summary":"","highlights":[],"projects":[{"startDate":"2016-11","title":"Resume Site","noEndDate":true,"summary":"This site is a custom built resume management system distorting toward developer-type resumes."},{"startDate":"2017-12","title":"Blue Spark 2018","noEndDate":true,"summary":"This application managed the check-ins for hundreds of attendees at tradeshow. It interfaced with a barcode scanner where booth attendants would scan the attendees for CRM follow-up."},{"startDate":"2016-11","title":"Blue Spark 2017","noEndDate":true,"summary":"This application managed the check-ins for hundreds of attendees at tradeshow. It interfaced with a barcode scanner where booth attendants would scan the attendees for CRM follow-up."},{"startDate":"2015-11","title":"Blue Spark 2016","noEndDate":true,"summary":"This application managed the check-ins for hundreds of attendees at tradeshow. It interfaced with a barcode scanner where booth attendants would scan the attendees for CRM follow-up."},{"startDate":"2015-10","title":"Title not disclosed","noEndDate":true,"summary":"Customer desired to have a native iOS application that could download and play offline content of prepared speaking presentations."},{"startDate":"2015-09","title":"Tixers","noEndDate":true,"summary":"Tixers is a third-party ticket marketplace for sports, music and other events."},{"startDate":"2014-09","title":"Title not disclosed","noEndDate":true,"summary":"Posed with a frequently updated content, this application is a solution for qualified speakers to access content and assemble presentations. The application features authenticated user management."},{"startDate":"2014-06","title":"Guardiant","noEndDate":true,"summary":"Internal customized CMS-based site for Guardiant."},{"startDate":"2014-04","title":"Hunger Hub","noEndDate":true,"summary":"This application commission provided search and identification of the various food banks and feeding sites throughout Central Ohio in cooperation with Hands On Central Ohio."},{"startDate":"2013-11","title":"Presentation Builder","noEndDate":true,"summary":"Designed and maintain Web application that manages approved content for doctors and speakers to create and manage presentations for Fortune 500 company."},{"startDate":"2013-08","title":"Braner","noEndDate":true,"summary":"Internal customized CMS-based site for Braner."},{"startDate":"2013-06","title":"fōnhunt","noEndDate":true,"summary":"fōnhunt is a game platform where teams explore a setting to solve puzzles and clues using their own phones. Played either as a one time event, perfect for team-building, fundraising, or trade shows, or as an ongoing version to engage guests at venues such as resorts, zoos, or museums."},{"startDate":"2013-05","title":"Title not disclosed","noEndDate":true,"summary":"Business developers and community are brought together in this platform to discuss wants, needs and desires."},{"startDate":"2012-08","title":"Hilton Explorer","noEndDate":true,"summary":"The Columbus Hilton is home to many works of art. The Hilton Explorer is a mobile accessible app that explores the art and artists whose works comprise the downtown hotel's collection."},{"startDate":"2012-08","title":"CPI","noEndDate":true,"summary":"Customized CMS-based site for Compressor Products Intl."}]},{"company":"DSCI","website":"https://dsci.com","position":"Programmer","startDate":"2007-09","endDate":"2011-04","summary":"Defense and Aerospace development.","highlights":["Managed small team on two projects. I fulfilled small-scale managerial roles on contract development.","Assisted with composing and delivering bids for contracts.","Presented deliverables to clients or potential clients.","Conducted site visits and site surveys to assess problems and discover solutions."]},{"company":"United States Marine Corps","startDate":"2000-08","endDate":"2008-08","projects":[{"title":"Fallujah","noEndDate":true,"startDate":"2012-3","summary":""},{"title":"Baghdad Offensive","noEndDate":true,"startDate":"2012-3","summary":""}]},{"company":"Sogeti","website":"https://sogeti.com","position":"Contractor","startDate":"2011-04","endDate":"2011-12","summary":"Contractor Developer","clients":[{"title":"Victoria's Secret","url":"https://victoriassecret.com","position":"contractor","startDate":"2011-09","endDate":"2011-12","summary":"work"},{"title":"Abercrombie & Fitch","url":"https://anf.com","position":"contractor","startDate":"2011-04","endDate":"2011-09","summary":"work"}]},{"company":"Victoria's Secret","website":"https:/www.victoriassecret.com","position":"Sr. Developer","startDate":"2011-12","priority":1,"summary":"Work on PINK Nation","highlights":[],"projects":[{"startDate":"2016-11-07","title":"Light It Up!","noEndDate":true,"summary":"Light It Up! is an experience where a visiting user has the chance to flip a digital light switch. The user then wins a redemption offer, saveable meme, or $250 PINK gift card."},{"startDate":"2016-10-03","title":"Snapchat Super Star","noEndDate":true,"summary":"Users would submit a Snapchat Story video in a contest where one user would win a trip to New York City and be at the helm of the PINK Snapchat account for a day."},{"startDate":"2016-07-07","title":"Backpack Scanner","noEndDate":true,"summary":"Backpack Scanner was an sweepstakes initiative to provide college girls with the chance to win cool stuff."},{"startDate":"2016-03-22","title":"Campus Recruitment - Application","noEndDate":true,"summary":"Campus Recruitment is both an PINK Nation initiative and an internal tool used to engage, recruit and review candidates for PINK Nation Campus Representative positions. The Application portion featured comprehensive multi-page form entry describing her, her interests and passion for the brand. At the end of the recruitment application form, she would submit her video describing why she would be the ultimate Brand Ambassador."},{"startDate":"2016-03-22","title":"Campus Recruitment - Scheduling","noEndDate":true,"summary":"The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."},{"startDate":"2016-01-05","title":"Squad Challenge","noEndDate":true,"summary":"Squad Challenge provided the PINK Nation girl with a wizard-like experience to announce where she and her squad were going for Spring Break. The user would be guided step-by-step to fill in various fields depicting her Spring Break intentions. In the penultimate step, she was able to include a background image for her squad announcement to be rendered upon. Finally, she was able to save her squad announcement or share it out to social."},{"startDate":"2015-11-04","title":"Holiday Elfie","noEndDate":true,"summary":"The Holiday Elfie experience featured ornamental imagery superimposed upon user submitted photos and stop-motion style videos created by the PINK Nation mobile app."},{"startDate":"2015-03-24","title":"PINKapalooza","noEndDate":true,"summary":"Inspired by the highly popular McDonald's Monopoly game, PINKapalooza was an experience where a girl could collect various unique tickets to win prizes. Each day, the girl could reveal three tickets. Accrued tickets would be visibile on her game board where she could see what tickets she needed to unlock different prizes. Each day she drew her tickets, she would also receive an additional entry into a sweepstakes at the end of the experience."},{"startDate":"2015-02-23","title":"PINK Nation Spring Break Simul Party","noEndDate":true,"summary":"This experience was a multi-phased experience. During the initial phase, the application provided the ability to register for the official PINK Nation Spring Break party to be held in Miami. The user could register and receive a digital invitation to admit them to the event. Users who could not attend the official party were able to access a store locator to attend an in-store experience. On the day of the Miami party, the application switched to a phase that would monitor certain hashtags on social media feeds. The Simul Party experience provided a colorful visualization of the frequency and intensity of the hashtag mentions."},{"startDate":"2014-11-18","title":"Registration Update","noEndDate":true,"summary":"The core registration and profile management process of desktop and mobile was audited and aligned to be consistent across experiences."},{"startDate":"2014-08-14","title":"Campus Showdown 2014","noEndDate":true,"summary":"In the 2014 edition of Campus Showdown, girls would vote for their schools through progressive rounds. The top ranked teams at the completion of each round would move on to subsequent rounds. The rounds were 24 hours long and girls would have to submit entries via hashtagged social media based submissions. During each 24 hour period, special hours would be designated Blitz Hours where entries were given additional bonus points. After the final round, the top four teams were pitted together in a 24-hour tap off. The team which had the most amount of cumulative taps in the 24 hour period was crowned the champion."},{"startDate":"2014-07-03","title":"PINK Minidog Scan Unlock","noEndDate":true,"summary":"Girls going to orientation at selected PINK collegiate schools would receive a PINK insert in their orientation book. The girl could scan a special image that would display an augmented reality PINK dog. After the PINK dog animation, the experience would immediately see if she won a prize in sweepstakes drawing."},{"startDate":"2014-04-18","title":"PINK Class of 2014","noEndDate":true,"summary":"The Class of 2014 catered to outgoing high school seniors to announce what colleges that they got accepted at. Girls would submit photos of themselves to the experience. Next, they chose which school they were going to attend. The photo frame would be superimposed onto the photo with the girl's name and her chosen school. The frame color and text color would be in the primary and secondary school colors of the selected school. Girls could download this photo or share it immediately to Facebook or Twitter."},{"startDate":"2014-03-06","title":"PINK Spring Breakers","noEndDate":true,"summary":"PINK Spring Breakers was a social media feed and promo mashup. The application tracked certain hashtags on a variety of social media platforms and pulled that content into an exhaustive masonry display."},{"startDate":"2013-11-04","title":"Holiday Mystery Box Tour","noEndDate":true,"summary":"The Mystery Box Tour centered around a giant freebie-filled box that would travel to a handful of PINK stores. The application would provide hints of where it was to travel next and reveal them based on a scheduled time. It also included a social media feed."},{"startDate":"2013-09-05","title":"PINK Nation Campus Party","noEndDate":true,"summary":"This experience was centered around monitoring the social feeds for the Back to School party won from the Collegiate Showdown. After the party, it transitioned to a timeline to track the rest of the tour stops and RSVP on Facebook."},{"startDate":"2013-08-05","title":"School Spirit Rally","noEndDate":true,"summary":"This back to school initiative was another voting experience. Girls would vote for their school. At the completion of the duration of the experience, the top school scored a PINK surprise."},{"startDate":"2013-04-16","title":"Summer of PINK","noEndDate":true,"summary":"Each of the four weeks of Summer of PINK campaign would focus on a single letter of P, I, N, and K . Girls would take creative photos of the letter of the week and submit it via Instagram with a corresponding hashtag. Those submissions would be pulled into the application experience. At the conclusion of the campaign, the most creative photographers would receive a $500 PINK summer shopping spree."},{"startDate":"2013-04-01","title":"Collegiate Showdown","noEndDate":true,"summary":"Inspired by March Madness, Collegiate Showdown was an experience that bracketed schools to face each other in head-to-head vote offs. This 20 day experience seeded schools against each other for four days of voting per bracket elimination. The final four schools then faced three 24 hour social media challenges to accrue points. The winner was crowned at the completion of the three social media rounds and received an ultimate Back to School party."},{"startDate":"2013-03-10","title":"Nominate Your Rep","noEndDate":true,"summary":"This experience was a vote-off of the 2000 collegiate schools that did not currently have a PINK campus rep. Each day a girl could submit a vote for her school. At the end of the voting period, the top 10 schools would be ushered into the PINK Campus Rep program with two appointed representatives."},{"startDate":"2013-02-12","title":"Dance Flipbook","noEndDate":true,"summary":"PINK Nation members submitted photographs of themselves performing a dance move during the duration of this experience. After the submission phase, the thousands of submissions were curated for the best which were stitched together in a flipbook-style animation video backed by a music track."},{"startDate":"2013-02-01","title":"PINK Nation Platform","noEndDate":false,"summary":"PINK Nation existed as a portal on a third-party site and developed by third-party developers. This endeavour brought the experience in-house and under a new platform based on the Grails web application framework powered by the Groovy language."}]}],"education":[{"institution":"Full Sail University","studyType":"Game Development and Design","startDate":"2005-09","endDate":"2007-09"},{"institution":"Marine Corps Reserve Deployments","startDate":"2001-09-11","endDate":"2005-06"},{"institution":"Eastern Kentucky University","startDate":"2001-08","endDate":"2001-12"},{"institution":"Northern Kentucky University","startDate":"1997-08","endDate":"2000-05"}],"volunteer":[{"flavor":"military","organization":"US Marine Corps Reserves","position":"NCO","startDate":"2000-08","endDate":"2008-07","website":"http://www.usmc.mil/","summary":"Summary of this military stint.","highlights":["Accomplishment 1","Accomplishment 2","etc"]}],"awardsPH":[{"flavor":"award","title":"Honorable Mention","date":"2012","awarder":"Google"},{"flavor":"honor","title":"Summa cum laude","date":"2012","awarder":"Cornell University"}],"basics":{"label":"Sr. Developer","characterClass":"Programmer","quote":null,"website":"https://www.mblorenz.com","phone":"859-801-5522","email":"mbl@mblorenz.com","other":[{"label":"Personal Email","flavor":"email","value":"blorenz@gmail.com"}],"name":"M. Brandon Lorenz","summary":null,"picture":null,"profiles":[{"network":"GitHub","username":"blorenz","url":"https://github.com/blorenz"}]},"interests":[{"name":"Youth Engineering","summary":"I am passionate about introducing engineering and software development to youth education. I have served as a mentor for the Coding Club at Liberty Christian Academy based on Google's education program. I look forward to establishing a program in cooperation with the local library to introduce and acclimate kids to these topics. I work with my 10-year old daughter in her passionate exploration of all things STEM-related."},{"name":"hockey","summary":"I play for the Columbus Thunder in the Columbus Adult Hockey D League. I have contributed to three Championship wins since starting hockey in Jan 2015."}],"references":0,"languagesPH":[{"language":"English","level":"Native"}],"skills":[{"name":"Web","level":"advanced","keywords":["Python","Django","JavaScript","HTML5","CSS","REST","GraphQL"]},{"name":"JavaScript","level":"master","keywords":["ReactJS","NodeJS","Webpack","Babel"]},{"name":"Database","level":"intermediate","keywords":["PostgreSQL","MySQL"]},{"name":"Containerization","level":"intermediate","keywords":["Docker","docker-compose"]},{"name":"sysadmin","level":"advanced","keywords":["Linux"]},{"name":"AWS","level":"advanced","keywords":["EB","EC2","ECR","RDS","S3"]},{"name":"Project","level":"advanced","keywords":["Agile","Trello","JIRA","GitHub"]}],"referencesWITHHELD":[{"name":"Mike Reed","reference":"Jane is awesome! I'd hire her again in a heartbeat."}]}
