{
  "basics": {
    "name": "M. Brandon Lorenz"
  },
  "work": [
    {
      "company": "Victoria's Secret",
      "website": "https:/www.victoriassecret.com",
      "position": "Lead Developer",
      "startDate": "2011-12",
      "priority": 1,
      "summary": "I create experiences for PINK Nation.",
      "highlights": [
      ],
      "projects": [
        {
          "startDate": "2018-05-05",
          "title": "Cinco De Mayo API",
          "noEndDate": true,
          "summary": "The 5th of May had a one-day experience where users could try to win electronic gift cards by breaking a pinata."
        },
        {
          "startDate": "2018-05-23",
          "title": "Pool's Open API",
          "noEndDate": true,
          "summary": "This experience launched alongside Memorial Day to kick-off the Summer season. I constructed an API for a native mobile app experience to collect entries across a timespan to award gift cards to a select number of winners."
        },
        {
          "startDate": "2018-07-08",
          "title": "WEW Memory Game API",
          "noEndDate": true,
          "summary": "The Wear Everywhere Memory Game was a native mobile app that ran for 30 days. The user would create six matches from 12 card to complete the board. I developed the backend API for syncing app state and submit completed boards. Completed boards had a chance of winning a $49 electronic gift card based on configurable odds and rate-per-day distribution of gift cards."
        },
        {
          "startDate": "2017-12-17",
          "title": "Post Holiday Hidden Capsule Experience",
          "noEndDate": true,
          "summary": "Girls could scan a flyer in a PINK Store with a native mobile app to enter a timeboxed multi-phase experience. The first phase was a hype page to get her ready for the next phase. The second phase was where she was presented an offer. She could share out the offer by clicking to copy a special link to send to friends via email or social media. This link led to a password-protected page that would reveal the offer upon correctly entering the password. The experience would transition into the third, and final, stage when the product was identified as being completely sold out."
        },
        {
          "startDate": "2018-01-07",
          "title": "PINK Horoscope",
          "noEndDate": true,
          "summary": "Girls could use a rotary wheel to select zodiac symbol and she would receive a PINK-branded horoscope."
        },
        {
          "startDate": "2018-01-07",
          "title": "My Paradise Is",
          "noEndDate": true,
          "summary": "Sweepstakes where girls could enter for a chance to win an AirBNB at a luxury house in one of three destination cities."
        },
        {
          "startDate": "2017-01-07",
          "title": "PINK Nation Spring Breakers",
          "noEndDate": true,
          "summary": ""
        },
        {
          "startDate": "2017-01-07",
          "title": "Custom Snapchat Geo Filters",
          "noEndDate": true,
          "summary": "Girls could create a Snapchat Geo Filter by choosing different frames, dragging and modifying stickers, and enter custom text.  Geo Filters could be saved to the camera roll where they were submitted from to Snapchat."
        },  {
          "startDate": "2017-01-05",
          "title": "Hello Sun",
          "noEndDate": true,
          "summary": "Sweepstakes based game where users would shake their phone to make a coconut fall from a palm tree.  When the coconut struck the bottom of the screen, it would break open and enter them into a sweepstakes drawing."
        },
        {
          "startDate": "2016-11-07",
          "title": "Light It Up!",
          "noEndDate": true,
          "summary": "Light It Up! is an experience where a visiting user has the chance to flip a digital light switch. The user then wins a redemption offer, saveable meme, or $250 PINK gift card."
        },
        {
          "startDate": "2016-10-03",
          "title": "Snapchat Super Star",
          "noEndDate": true,
          "summary": "Users would submit a Snapchat Story video in a contest where one user would win a trip to New York City and be at the helm of the PINK Snapchat account for a day."
        },
        {
          "startDate": "2016-07-07",
          "title": "Backpack Scanner",
          "noEndDate": true,
          "summary": "Backpack Scanner was an sweepstakes initiative to provide college girls with the chance to win cool stuff."
        },
        {
          "startDate": "2016-03-22",
          "title": "Campus Recruitment 2016 - Application",
          "noEndDate": true,
          "summary": "Campus Recruitment is both an PINK Nation initiative and an internal tool used to engage, recruit and review candidates for PINK Nation Campus Representative positions. The Application portion featured comprehensive multi-page form entry describing her, her interests and passion for the brand. At the end of the recruitment application form, she would submit her video describing why she would be the ultimate Brand Ambassador."
        },
        {
          "startDate": "2016-03-22",
          "title": "Campus Recruitment 2016 - Scheduling",
          "noEndDate": true,
          "summary": "The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."
        },
        {
          "startDate": "2017-03-22",
          "title": "Campus Recruitment 2017 - Application",
          "noEndDate": true,
          "summary": "Campus Recruitment is both an PINK Nation initiative and an internal tool used to engage, recruit and review candidates for PINK Nation Campus Representative positions. The Application portion featured comprehensive multi-page form entry describing her, her interests and passion for the brand. At the end of the recruitment application form, she would submit her video describing why she would be the ultimate Brand Ambassador."
        },
        {
          "startDate": "2017-03-22",
          "title": "Campus Recruitment 2017 - Scheduling",
          "noEndDate": true,
          "summary": "The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."
        },
        {
          "startDate": "2018-03-22",
          "title": "Campus Recruitment 2018 - Application",
          "noEndDate": true,
          "summary": "Campus Recruitment is both an PINK Nation initiative and an internal tool used to engage, recruit and review candidates for PINK Nation Campus Representative positions. The Application portion featured comprehensive multi-page form entry describing her, her interests and passion for the brand. At the end of the recruitment application form, she would submit her video describing why she would be the ultimate Brand Ambassador."
        },
        {
          "startDate": "2018-03-22",
          "title": "Campus Recruitment 2018 - Scheduling",
          "noEndDate": true,
          "summary": "The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."
        },
        {
          "startDate": "2018-03-22",
          "title": "Campus Recruitment 2018 - Admin",
          "noEndDate": true,
          "summary": "The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."
        },
        {
          "startDate": "2018-03-22",
          "title": "Campus Recruitment 2018 - Email",
          "noEndDate": true,
          "summary": "The Campus Recruitment Scheduler is a CRM tool inspired by Apple's Genius Bar appointment scheduler. Girls who were identified has potential candidates would be emailed special links where she could book a time slot for her Skype based interview. At the end, the candidate would receive an email confirming her scheduled slot and have the ability to add the appointment to her calendaring program."
        },
        {
          "startDate": "2016-01-05",
          "title": "Squad Challenge",
          "noEndDate": true,
          "summary": "Squad Challenge provided the PINK Nation girl with a wizard-like experience to announce where she and her squad were going for Spring Break. The user would be guided step-by-step to fill in various fields depicting her Spring Break intentions. In the penultimate step, she was able to include a background image for her squad announcement to be rendered upon. Finally, she was able to save her squad announcement or share it out to social."
        },
        {
          "startDate": "2015-11-04",
          "title": "Holiday Elfie",
          "noEndDate": true,
          "summary": "The Holiday Elfie experience featured ornamental imagery superimposed upon user submitted photos and stop-motion style videos created by the PINK Nation mobile app."
        },
        {
          "startDate": "2015-03-24",
          "title": "PINKapalooza",
          "noEndDate": true,
          "summary": "Inspired by the highly popular McDonald's Monopoly game, PINKapalooza was an experience where a girl could collect various unique tickets to win prizes. Each day, the girl could reveal three tickets. Accrued tickets would be visibile on her game board where she could see what tickets she needed to unlock different prizes. Each day she drew her tickets, she would also receive an additional entry into a sweepstakes at the end of the experience."
        },
        {
          "startDate": "2015-02-23",
          "title": "PINK Nation Spring Break Simul Party",
          "noEndDate": true,
          "summary": "This experience was a multi-phased experience. During the initial phase, the application provided the ability to register for the official PINK Nation Spring Break party to be held in Miami. The user could register and receive a digital invitation to admit them to the event. Users who could not attend the official party were able to access a store locator to attend an in-store experience. On the day of the Miami party, the application switched to a phase that would monitor certain hashtags on social media feeds. The Simul Party experience provided a colorful visualization of the frequency and intensity of the hashtag mentions."
        },
        {
          "startDate": "2014-11-18",
          "title": "Registration Update",
          "noEndDate": true,
          "summary": "The core registration and profile management process of desktop and mobile was audited and aligned to be consistent across experiences."
        },
        {
          "startDate": "2014-08-14",
          "title": "Campus Showdown 2014",
          "noEndDate": true,
          "summary": "In the 2014 edition of Campus Showdown, girls would vote for their schools through progressive rounds. The top ranked teams at the completion of each round would move on to subsequent rounds. The rounds were 24 hours long and girls would have to submit entries via hashtagged social media based submissions. During each 24 hour period, special hours would be designated Blitz Hours where entries were given additional bonus points. After the final round, the top four teams were pitted together in a 24-hour tap off. The team which had the most amount of cumulative taps in the 24 hour period was crowned the champion."
        },
        {
          "startDate": "2014-07-03",
          "title": "PINK Minidog Scan Unlock",
          "noEndDate": true,
          "summary": "Girls going to orientation at selected PINK collegiate schools would receive a PINK insert in their orientation book. The girl could scan a special image that would display an augmented reality PINK dog. After the PINK dog animation, the experience would immediately see if she won a prize in sweepstakes drawing."
        },
        {
          "startDate": "2014-04-18",
          "title": "PINK Class of 2014",
          "noEndDate": true,
          "summary": "The Class of 2014 catered to outgoing high school seniors to announce what colleges that they got accepted at. Girls would submit photos of themselves to the experience. Next, they chose which school they were going to attend. The photo frame would be superimposed onto the photo with the girl's name and her chosen school. The frame color and text color would be in the primary and secondary school colors of the selected school. Girls could download this photo or share it immediately to Facebook or Twitter."
        },
        {
          "startDate": "2014-03-06",
          "title": "PINK Spring Breakers",
          "noEndDate": true,
          "summary": "PINK Spring Breakers was a social media feed and promo mashup. The application tracked certain hashtags on a variety of social media platforms and pulled that content into an exhaustive masonry display."
        },
        {
          "startDate": "2013-11-04",
          "title": "Holiday Mystery Box Tour",
          "noEndDate": true,
          "summary": "The Mystery Box Tour centered around a giant freebie-filled box that would travel to a handful of PINK stores. The application would provide hints of where it was to travel next and reveal them based on a scheduled time. It also included a social media feed."
        },
        {
          "startDate": "2013-09-05",
          "title": "PINK Nation Campus Party",
          "noEndDate": true,
          "summary": "This experience was centered around monitoring the social feeds for the Back to School party won from the Collegiate Showdown. After the party, it transitioned to a timeline to track the rest of the tour stops and RSVP on Facebook."
        },
        {
          "startDate": "2013-08-05",
          "title": "School Spirit Rally",
          "noEndDate": true,
          "summary": "This back to school initiative was another voting experience. Girls would vote for their school. At the completion of the duration of the experience, the top school scored a PINK surprise."
        },
        {
          "startDate": "2013-04-16",
          "title": "Summer of PINK",
          "noEndDate": true,
          "summary": "Each of the four weeks of Summer of PINK campaign would focus on a single letter of P, I, N, and K . Girls would take creative photos of the letter of the week and submit it via Instagram with a corresponding hashtag. Those submissions would be pulled into the application experience. At the conclusion of the campaign, the most creative photographers would receive a $500 PINK summer shopping spree."
        },
        {
          "startDate": "2013-04-01",
          "title": "Collegiate Showdown",
          "noEndDate": true,
          "summary": "Inspired by March Madness, Collegiate Showdown was an experience that bracketed schools to face each other in head-to-head vote offs. This 20 day experience seeded schools against each other for four days of voting per bracket elimination. The final four schools then faced three 24 hour social media challenges to accrue points. The winner was crowned at the completion of the three social media rounds and received an ultimate Back to School party."
        },
        {
          "startDate": "2013-03-10",
          "title": "Nominate Your Rep",
          "noEndDate": true,
          "summary": "This experience was a vote-off of the 2000 collegiate schools that did not currently have a PINK campus rep. Each day a girl could submit a vote for her school. At the end of the voting period, the top 10 schools would be ushered into the PINK Campus Rep program with two appointed representatives."
        },
        {
          "startDate": "2013-02-12",
          "title": "Dance Flipbook",
          "noEndDate": true,
          "summary": "PINK Nation members submitted photographs of themselves performing a dance move during the duration of this experience. After the submission phase, the thousands of submissions were curated for the best which were stitched together in a flipbook-style animation video backed by a music track."
        },
        {
          "startDate": "2013-02-01",
          "title": "PINK Nation Platform",
          "noEndDate": false,
          "summary": "PINK Nation existed as a portal on a third-party site and developed by third-party developers. This endeavour brought the experience in-house and under a new platform based on the Grails web application framework powered by the Groovy language."
        }
      ]
    }
  ],
  "referencesWITHHELD": [
    {
      "name": "Mike Reed",
      "reference": "Jane is awesome! I'd hire her again in a heartbeat."
    }
  ]
}